@echo off
;mode con: cols=100 lines=30
title Command Prompt Portable
chcp 65001 >nul
echo.
echo.
echo.
echo [34m                          ┌─┐┌─┐┌┬┐┌┬┐┌─┐┌┐┌┌┬┐  ┌─┐┬─┐┌─┐┌┬┐┌─┐┌┬┐  ┌─┐┌─┐┬─┐┌┬┐┌─┐┌┐ ┬  ┌─┐[0m
echo [94m                          │  │ │││││││├─┤│││ ││  ├─┘├┬┘│ ││││├─┘ │   ├─┘│ │├┬┘ │ ├─┤├┴┐│  ├┤ [0m
echo [96m                          └─┘└─┘┴ ┴┴ ┴┴ ┴┘└┘─┴┘  ┴  ┴└─└─┘┴ ┴┴   ┴   ┴  └─┘┴└─ ┴ ┴ ┴└─┘┴─┘└─┘[0m
echo.
echo.
echo.
for /f %%A in ('"prompt $H &echo on &for %%B in (1) do rem"') do set BS=%%A
:input
echo.
echo [97m╔══[0m([92m%username%[0m@[95m%computername%[0m)-[[91m%cd%[0m]
set /p cmd=".%BS%[97m╚══>[0m "
echo.
%cmd%
goto input

